Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པའི་ཛེ་ཏའི་ཚལ་མགོན་མེད་པ་ལ་ཟས་སྦྱིན་པའི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་བརྒྱ་ཕྲག་བྱེད་དང་བཅུ་གསུམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་རྣམས་དང་ཡང་ཐབས་ཅིག་པ་ལ་འདི་ལྟ་སྟེ།
en: Thus have I heard: One time the Bhagavat was staying, with a great saṅgha of 1,250 bhikṣus and a multitude of bodhisattvas, at Jetavana, the monastery of Anāthapiṇḍada, in Śrāvastī.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་བློ་གྲོས་དང་།
en: such as Bodhisattva Mahāsattva Vajramati,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་མཐོང་བ་དང་།
en: Bodhisattva Mahāsattva Jñānadarśana,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྡེ་དང་།
en: Bodhisattva Mahāsattva Vajrasena,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གསང་སྦེན་དང་།
en: Bodhisattva Mahāsattva Guhyagupta,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་དང་།
en: Bodhisattva Mahāsattva Ākaśagarbha,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་དང་།
en: Bodhisattva Mahāsattva Sūryagarbha,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་མི་གཏོང་བ་དང་།
en: Bodhisattva Mahāsattva Anikṣiptadhura,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རིན་པོ་ཆེ་དང་།
en: Bodhisattva Mahāsattva Ratnapāṇi,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་དང་།
en: Bodhisattva Mahāsattva Samantabhadra,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་དང་།
en: Bodhisattva Mahāsattva Mahāsthāmaprāpta,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་།
en: Bodhisattva Mahāsattva Sarva­nīvaraṇa­viṣkambhin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་དཔའ་བ་དང་།
en: Bodhisattva Mahāsattva Sarvaśūra,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨན་གྱི་སྡེ་དང་།
en: Bodhisattva Mahāsattva Bhaiṣajyasena,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དང་།
en: Bodhisattva Mahāsattva Avalokiteśvara,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་།
en: Bodhisattva Mahāsattva Vajrapāṇi,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱ་མཚོ་མཆིང་རྣམ་བློ་གྲོས་དང་།
en: Bodhisattva Mahāsattva Sāgaramati,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆེན་པོ་ཆོས་འཛིན་དང་།
en: Bodhisattva Mahāsattva Dharmadhara,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སའི་སྤྱན་མཆོག་དང་།
en: Bodhisattva Mahāsattva Pṛthivīvaralocana,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབུགས་ཕྱིན་པའི་ལག་པ་དང་།
en: Bodhisattva Mahāsattva Āśvāsahasta,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། །
en: and Bodhisattva Mahāsattva Maitreya.

source: གཞན་ཡང་དབང་ཕྱུག་དང་། མཐུ་བོ་ཆེ་ལ་སོགས་པ་ལྷའི་སྡེ་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་ལྷའི་སྲས་པོ་རྣམས་ཀྱང་ཚོགས་སོ། །གཞན་ཡང་ལྷའི་སྡེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་བུ་རྣམས་ཚོགས་ཏེ། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། རླུང་གི་ལྷ་དང་། ཆུའི་ལྷ་ལ་སོགས་པ། ལྷའི་བུ་དེ་དག་ཚོགས་པ་དང་ལྷན་ཅིག་ཏུ། བརྒྱ་བྱིན་ལྷའི་དབང་པོ་དང་། ཚངས་པ་མི་མཇེད་ཀྱི་བདག་པོ་དག་ཀྱང་ཚོགས་སོ། །
en: The thirty-two classes of devas had also gathered there, the principal ones being Maheśvara and Nārāyaṇa. Śakra, who is the lord of the devas, Brahmā, who is the lord of the Sahā universe, Candra, Āditya, Vāyu, Varuṇa, and other deities were also assembled there.

source: འཁོར་དེ་ན་ཀླུའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་ཚོགས་པ་རྣམས་འདི་ལྟ་སྟེ།
en: Many hundreds of thousands of nāga kings had also gathered there in that retinue.

source: ཀླུའི་རྒྱལ་པོ་ཨུད་པ་ལ་དང་། ཀླུའི་རྒྱལ་པོ་ཤིང་ཨེ་ལའི་ལོ་མ་ཅན་དང་། ཀླུའི་རྒྱལ་པོ་ཉ་ཟན་དང་། ཀླུའི་རྒྱལ་པོ་བ་ལང་གི་བདག་པོ་དང་། ཀླུའི་རྒྱལ་པོ་མགོ་བརྒྱ་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཧུ་ལུ་ཏ་དང་། ཀླུའི་རྒྱལ་པོ་འཇོག་པོ་དང་། ཀླུའི་རྒྱལ་པོ་གླང་མགོ་དང་། ཀླུའི་རྒྱལ་པོ་རི་དགས་མགོ་དང་། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། བསྙེན་དགའ་བོ་དང་། ཀླུའི་རྒྱལ་པོ་བད་སའི་རིགས་ཀྱི་བུ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་མཆིང་རྣམ་དང་། དེ་ལྟ་བུ་དག་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་ཚོགས་སོ། །
en: Nāga King Utpala, Nāga King Elapatra, Nāga King Timiṃgira, Nāga King Gavāṃpati, Nāga King Śataśīrṣa, Nāga King Hullura, Nāga King Vahūdaka, Nāga King Takṣaka, Nāga King Gośīrṣa, Nāga King Mṛgaśīrṣa, Nāga Kings Nanda and Upananda, Nāga King Vātsīputra, Nāga King Sāgara, Nāga King Anavatapta, and many hundreds of thousands of other nāga kings were gathered there.

source: དྲི་ཟའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་ཚོགས་པ་འདི་ལྟ་སྟེ། དྲི་ཟའི་རྒྱལ་པོ་རྔའི་དབྱངས་ཀྱི་རྒྱལ་པོ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཡིད་དུ་འོང་བའི་དབྱངས་དང་། དྲི་ཟའི་རྒྱལ་པོ་ལག་པ་སྟོང་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་བློ་གྲོས་ཆེན་པོ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ལུས་སིམ་པར་བྱེད་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་སིལ་སྙན་སྒྲ་བསྒྲགས་དང་། དྲི་ཟའི་རྒྱལ་པོ་རྒྱན་གྱིས་བརྒྱན་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་གཞོན་ནུར་སྣང་བ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ལག་པ་བཟང་པོ་དང་ལྡན་པ་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཆོས་དགའ་དང་། དེ་ལྟ་བུ་ལ་སོགས་པ་དྲི་ཟའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དག་ཚོགས་སོ། །
en: Many hundreds of thousands of gandharva kings had also assembled there. Gandharva King Dundubhisvara, Gandharva King Manojñasvara, Gandharva King Sahasrabhuja, Gandharva King Sahāpati, Gandharva King Śarīraprahlādana, Gandharva King Nirnāditabhūrya, Gandharva King Alaṃkārabhūṣita, Gandharva King Kumāradarśana, Gandharva King Subāhuyukta, Gandharva King Dharmapriya, and many hundreds of thousands of gandharva kings were gathered there in that retinue.

source: འཁོར་དེར་མིའམ་ཅི་བརྒྱ་སྟོང་དུ་མ་ཚོགས་པ་འདི་ལྟ་སྟེ། མིའམ་ཅིའི་རྒྱལ་པོ་བཞིན་བཟངས་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ཅོད་པན་ཅན་དང་། མིའམ་ཅིའི་རྒྱལ་པོས་རིའི་བཞིན་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་རབ་ཏུ་དགའ་བྱས་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་འཁོར་ལོ་བཀོད་པ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་མེ་ཏོག་གཏོར་བ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ནོར་བུ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་གསུས་ཤོལ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་བརྩོན་འགྲུས་བརྟན་པ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ཤིན་ཏུ་འཐད་པ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་བཞིན་བརྒྱ་པ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ཤིང་རློན་དང་། དེ་ལྟ་བུ་ལ་སོགས་པ་མིའམ་ཅིའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དག་ཚོགས་སོ། །
en: Also gathered in that retinue were many hundreds of thousands of kiṃnara kings. Kiṃnara King Sumukha, Kiṃnara King Ratnakirītī, Kiṃnara King Svārimukha, Kiṃnara King Prahasita, Kiṃnara King Cakravyūha, Kiṃnara King Puṣpāvakīrṇa, Kiṃnara King Maṇi, Kiṃnara King Pralambodara, Kiṃnara King Dṛdhavīrya, Kiṃnara King Suyodhana, Kiṃnara King Śatamukha, Kiṃnara King Druma, and many hundreds of thousands of other kiṃnara kings were gathered there.

source: ལྷའི་བུ་མོ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་ཚོགས་པ་འདི་ལྟ་སྟེ། ལྷའི་བུ་མོ་ཏི་ལ་མཆོག་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ཤིན་ཏུ་བཀོད་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་གསེར་གྱི་སྐ་རགས་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་རྒྱན་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་གདོས་འཛིན་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་བདུད་རྩིའི་ཐིགས་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ལུས་ཡོངས་སུ་མཛེས་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ནོར་བུའི་འོད་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་གཙུག་ཕུད་ཅན་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ལྷའི་བཞིན་སྟོན་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་སིལ་སྙན་ལྔ་མངོན་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་དགའ་བར་བྱེད་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་གསེར་གྱི་ཕྲེང་བ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་མེ་ཏོག་ཨུད་པལ་སྔོན་པོ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ཆོས་མངོན་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ཤིན་ཏུ་རོལ་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་མ་ལུས་འབྱུང་གནས་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ཤིན་ཏུ་བཀོད་པའི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་དཔུང་རྒྱན་འཛིན་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་སྦྱིན་པ་སྦྱིན་བྱེད་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་མོ་ཟླ་བ་ཅན་དང་། དེ་ལྟ་བུ་ལ་སོགས་པ་ལྷའི་བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་དག་ཚོགས་སོ། །
en: Many hundreds of thousands of apsarases had gathered there. The apsaras named Tilottamā, the apsaras named Suvyūhā, the apsaras named Suvarṇamekhalā, the apsaras named Vibhūṣutā, the apsaras named Karṇadhārā, the apsaras named Amṛtabindu , the apsaras named Pariśobhitakāyā, the apsaras named Maṇiprasthanā, the apsaras named Cuḍakā, the apsaras named Mṛdukā, the apsaras named Pañcabhūryābhimukhā, the apsaras named Ratikarā, the apsaras named Kañcanamālā, the apsaras named Nīlotpalā, the apsaras named Dharmābhimukhā, the apsaras named Sakrīḍā, the apsaras named Kṛtsnākarā, the apsaras named Suvyūhamati, the apsaras named Keyūradharā, the apsaras named Dānaṃdadā, the apsaras named Śaśī, and many hundreds of thousands of other apsarases were gathered there.

source: ཀླུའི་བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་དག་ཀྱང་ཚོགས་པ་
en: Many hundreds of thousands of female nāgas were gathered there.

source: ཀླུའི་བུ་མོ་རྒྱན་འཛིན་ཅེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་པུ་ལིན་ད་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་རལ་པ་གསུམ་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་ས་རིའི་བཞིན་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་རྒྱལ་བའི་དཔལ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་གློག་གི་མིག་ཅེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་གློག་གི་འོད་ཅེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་ས་རི་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་གཡོག་བརྒྱ་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་སྨན་ཆེན་པོ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་ཐིགས་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་མགོ་གཅིག་མ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་བཞོན་པ་བརྒྱ་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་ཟ་བྱེད་ཅེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་མ་ལུས་འོངས་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་ཤིན་ཏུ་རྒྱན་མ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་ཐིག་ལེ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་སྤྲིན་དཀར་མོ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་དེ་བཞིན་དུ་ཆགས་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་གཏོང་ལྡན་མ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་འཁོར་མི་ཕྱེད་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་པུ་ལིན་ད་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་རྒྱ་མཚོ་མཆིང་རྣམ་མངལ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་གདུགས་ཀྱི་བཞིན་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་ཆོས་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་བདེ་བྱེད་ཅེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་བརྩོན་འགྲུས་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་རྒྱ་མཚོ་མཆིང་རྣམ་ལྟར་ཟབ་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་བུ་མོ་རི་རབ་ལྷུན་པོའི་དཔལ་ཞེས་བྱ་བ་དང་། དེ་ལྟ་བུ་ལ་སོགས་ཏེ་ཀླུའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་དག་ཚོགས་སོ། །
en: The female nāga named Vibhūṣaṇadharā, the female nāga named Acilillanā, the female nāga named Trijaṭā, the female nāga named Svātimukhā, the female nāga named Jayaśrī, the female nāga named Vijayaśrī, the female nāga named Mucilindā, the female nāga named Vidyullocanā, the female nāga named Vidyutprabhā, the female nāga named Svātigiri, the female nāga named Śataparivārā, the female nāga named Mahauṣadhi, the female nāga named Jalabindu, the female nāga named Ekaśīrṣā, the female nāga named Śatavāhāna, the female nāga named Śatabāhu, the female nāga named Grasatī, the female nāga named Anākṛtsnagatā, the female nāga named Subhūṣaṇā, the female nāga named Pāṇḍarameghā, the female nāga named Rathābhiruḍhā, the female nāga named Tyāgānugatā, the female nāga named Anāgatā, the female nāga named Abhinnaparivārā, the female nāga named Pulindā, the female nāga named Sāgarakukṣi, the female nāga named Chatramukhā, the female nāga named Dharmapīṭhā, the female nāga named Mukhakarā, the female nāga named Vīryā, the female nāga named Sāgaragambhīrā, the female nāga named Meruśrī, and many hundreds of thousands of other female nāgas were gathered there.

source: དྲི་ཟའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་ཚོགས་པ་
en: Many hundreds of thousands of female gandharvas had also gathered there.

source: དྲི་ཟའི་བུ་མོ་དགའ་བའི་བཞིན་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་དགའ་བའི་སྦྱིན་བྱེད་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མི་སྟོན་པ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རྡོ་རྗེའི་དཔལ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རྡོ་རྗེའི་ཕྲེང་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཕྲེང་བ་བཟང་པོ་ཅན་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ནགས་ཚལ་བདག་མོ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མེ་ཏོག་བརྒྱ་པ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མེ་ཏོག་འབུས་པ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་དུས་པའི་མེ་ཏོག་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མངལ་བཟང་མོ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རྒྱལ་པོའི་དཔལ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རྔ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཕྲེང་བ་བཟང་མོ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རྒྱན་གྱིས་བརྒྱན་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མངོན་པར་བཏུད་པ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཆོས་འདོད་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཆོས་སྦྱིན་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མེ་ཏོག་ཨུ་དུམ་བཱ་རའི་ལྟོ་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རྣམ་པ་བརྒྱ་པ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མེ་ཏོག་པད་མའི་དཔལ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མེ་ཏོག་པད་མའི་དམིགས་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ལུས་ཡོངས་སུ་མཛེས་པ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཆ་བས་དབང་པོ་བཞིན་དུ་འགྲོ་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ས་སྦྱིན་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་འབྲས་བུ་སྦྱིན་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་སེང་གེའི་འགྲོས་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མེ་ཏོག་ཀུ་མུ་ད་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཡིད་དགའ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་སྦྱིན་བྱེད་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ལྷའི་ཚིག་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་བཟོད་དགའ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མྱ་ངན་འདས་དགའ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རིན་ཆེན་མྱུ་གུ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་དབང་པོའི་དཔལ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་སྐྱེ་དགུའི་བདག་མོའི་གནས་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རི་དགས་ཀྱི་རྒྱལ་པོ་ཅན་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་དཔལ་འདབ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་འབར་བའི་རྩེ་མོ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་འདོད་ཆགས་ལས་ཡོངས་སུ་གྲོལ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཞེ་སྡང་ལས་ཡོངས་སུ་གྲོལ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་གཏི་མུག་ལས་ཡོངས་སུ་གྲོལ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་འཁོར་བ་སྲུངས་མ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་རིན་པོ་ཆེའི་ཁྲིའུ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་འོང་བ་དང་འགྲོ་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མེའི་འོད་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཟླ་བའི་གཟུགས་ཀྱི་འོད་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་ཉི་མའི་མིག་ཅེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་གསེར་ལྟར་སྣང་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་མཆོག་དགའ་ཞེས་བྱ་བ་དང་། དྲི་ཟའི་བུ་མོ་དམ་པའི་དཔལ་ཞེས་བྱ་བ་དང་། དེ་ལྟ་བུ་ལ་སོགས་པ་དྲི་ཟའི་བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་དག་ཚོགས་སོ། །
en: The female gandharva named Priyamukhā, the female gandharva named Priyaṃdadā, the female gandharva named Anādarśakā, the female gandharva named Vajraśrī, the female gandharva named Vajramālā, the female gandharva named Sumālinī, the female gandharva named Vanaspati, the female gandharva named Śatapuṣpā, the female gandharva named Mukulitā, the female gandharva named Ratnamālā, the female gandharva named Muditapuṣpā, the female gandharva named Sukukṣi, the female gandharva named Rājaśrī, the female gandharva named Dundubhi, the female gandharva named Śubhamālā, the female gandharva named Vibhūṣitālaṃkārā, the female gandharva named Abhinamitā, the female gandharva named Dharmakāṅkṣiṇī, the female gandharva named Dharmaṃdadā, the female gandharva named Audumbarā, the female gandharva named Śatākārā, the female gandharva named Padmaśriyā, the female gandharva named Padmāvatī, the female gandharva named Padmālaṃkārā, the female gandharva named Pariśobhitakāyā, the female gandharva named Vilāsendragāminī, the female gandharva named Pṛthivīṃdadā, the female gandharva named Phalaṃdadā, the female gandharva named Siṃhagāminī, the female gandharva named Kumudapuṣpā, the female gandharva named Manoramā, the female gandharva named Dānaṃdadā, the female gandharva named Devavacanā, the female gandharva named Kṣāntipriyā, the female gandharva named Nirvāṇapriyā, the female gandharva named Ratnāṅkurā, the female gandharva named Indraśrī, the female gandharva named Indramaghaśrī, the female gandharva named Prajāpatinivāsinī, the female gandharva named Mṛgarājinī, the female gandharva named Sphurantaśrī, the female gandharva named Jvalantaśikharā, the female gandharva named Rāgaparimuktā, the female gandharva named Dveṣaparimuktā, the female gandharva named Mohaparimuktā, the female gandharva named Sujanaparivārā, the female gandharva named Ratnapīṭhā, the female gandharva named Āgamanagamanā, the female gandharva named Agniprabhā, the female gandharva named Candrabimbaprabhā, the female gandharva named Sūryalocanā, the female gandharva named Suvarṇāvabhāsā, and many hundreds of thousands of other female gandharvas.

source: འཁོར་དེར་མིའམ་ཅིའི་བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་དག་ཚོགས་པ་
en: Many hundreds of thousands of female kiṃnaras had gathered there.

source: མི་འམ་ཅིའི་བུ་མོ་ཡིད་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཡིད་ལས་བྱུང་བ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རླུང་གི་ཤུགས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཆུའི་ཤུགས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ནམ་མཁའི་གཟིངས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་མགྱོགས་པའི་ཤུགས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་དཔལ་སྦྱིན་པ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་མཆེ་བ་བཟང་མོ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་མི་གཡོ་བའི་དཔལ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཁམས་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་འབར་བ་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཤིན་ཏུ་དཔལ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རིན་པོ་ཆེ་འབྱུང་གནས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་སྤྱན་རས་གཟིགས་ཀྱི་དཔལ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་སྟན་ཅན་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རྡོ་རྗེའི་ཁུ་ཚུར་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་སེར་སྐྱ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རྒྱན་རབ་བརྒྱན་པ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་དཔྲལ་བ་དབྱེས་ཆེན་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ངེས་པ་ཡོངས་སུ་བསྟེན་པ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་བློ་གྲོས་ཆེན་མོ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ནམ་མཁའ་སྲུང་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་བཀོད་པ་རྒྱལ་པོའི་དབང་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་གཙུག་ན་ནོར་བུ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ནོར་བུ་འཛིན་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ནོར་བུ་འབར་མ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་སྐྱེ་བོ་མཁས་པས་བསྟེན་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་བདོག་མ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཚེ་སྦྱིན་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་དེ་བཞིན་གཤེགས་པའི་མཛོད་ཡོངས་སུ་སྐྱོང་མ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་སྲུང་བ་ཞེས་བྱ་བ་དང་།
en: The female kiṃnara named Manasā, the female kiṃnara named Mānasī, the female kiṃnara named Vāyuvegā, the female kiṃnara named Varuṇavegā, the female kiṃnara named Ākāśaplavā, the female kiṃnara named Vegajavā, the female kiṃnara named Lakṣmīṃdadā, the female kiṃnara named Sudaṃṣṭrā, the female kiṃnara named Acalaśriyā, the female kiṃnara named Dhātupriyā, the female kiṃnara named Jvalantapriyā, the female kiṃnara named Suśriyā, the female kiṃnara named Ratnakāraṇḍakā, the female kiṃnara named Avalokitalakṣmī, the female kiṃnara named Kuṭilā, the female kiṃnara named Vajramuṣṭi, the female kiṃnara named Kapilā, the female kiṃnara named Subhūṣaṇabhūṣitā, the female kiṃnara named Vistīrṇalalāṭā, the female kiṃnara named Sujanaparisevitā, the female kiṃnara named Sahāpatī, the female kiṃnara named Ākāśarakṣitā, the female kiṃnara named Vyūharājendrā, the female kiṃnara named Maṇicūḍā, the female kiṃnara named Maṇidhāriṇī, the female kiṃnara named Maṇirocanī, the female kiṃnara named Vidvajjanaparisevitā, the female kiṃnara named Śatākārā, the female kiṃnara named Āyurdadā, the female kiṃnara named Tathāgatakośaparipālitā, the female kiṃnara named Dharmadhātuparirakṣiṇī,

source: མི་འམ་ཅིའི་བུ་མོ་རྐང་པའི་གདུ་བུའི་རྔ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་སྐད་ཅིག་སྒྲོལ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རྟག་ཏུ་ཆོས་ལེན་པར་འདོད་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རྟག་ཏུ་དུས་དུས་སུ་སྟོན་མ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་དབུགས་འབྱིན་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རྣམ་པར་ཐར་བྱེད་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཡོད་པ་མི་འཕྲོགས་པ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་སྐྱོ་འཛིན་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རལ་གྲི་འབར་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ས་ལ་འགྲོ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ལྷ་དབང་ཕྲེང་བ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ལྷ་མ་ཡིན་གྱི་དབང་མོ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ནོར་བུའི་དབང་མོ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རུས་བཟོད་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་སྦྱིན་ལྡན་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་མང་པོའི་གནས་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ལག་ཆ་བརྒྱ་པ་ཞེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་རྒྱན་གྱིས་བརྒྱན་པ་ཅེས་བྱ་བ་དང་། མི་འམ་ཅིའི་བུ་མོ་ཡིད་འཕྲོག་ཅེས་བྱ་བ་དང་།
en: the female kiṃnara named Satataparigrahadharmakāṅkṣiṇī, the female kiṃnara named Sadānukāladarśinī, the female kiṃnara named Nūpurottamā, the female kiṃnara named Lakṣaṇottamā, the female kiṃnara named Āśvāsanī, the female kiṃnara named Vimokṣakarā, the female kiṃnara named Sadānuvṛtti, the female kiṃnara named Saṃvegadhāriṇī, the female kiṃnara named Khaṅgajvalanā, the female kiṃnara named Pṛthivyupasaṃkramaṇā, the female kiṃnara named Surendramālā, the female kiṃnara named Surendrā, the female kiṃnara named Asurendrā, the female kiṃnara named Munīndrā, the female kiṃnara named Gotrakṣānti, the female kiṃnara named Tyāgānugatā, the female kiṃnara named Bahvāśrayā, the female kiṃnara named Śatāyudhā, the female kiṃnara named Vibhūṣitālaṃkārā, the female kiṃnara named Manoharā,

source: དེ་ལྟ་བུ་ལ་སོགས་པ་མི་འམ་ཅིའི་བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་དག་ཚོགས་སོ།
en: and many hundreds of thousands of other female kiṃnaras were gathered there.

source: དགེ་བསྙེན་ཕ་དང་། དགེ་བསྙེན་མ་བརྒྱ་ཕྲག་དུ་མ་དག་ཚོགས་སོ། །
en: Many hundreds of thousands of upāsakas and upāsikās had gathered there.

source: མུར་འདུག་སྤྱོད་པ་དང་། ཀུན་ཏུ་རྒྱུ་བ་དང་། གཅེར་བུ་པ་བརྒྱ་ཕྲག་དུ་མ་དག་ཀྱང་ཚོགས་ཏེ།
en: Many hundreds of thousands of tīrthika mendicant renunciants had also gathered there.

source: གང་གི་ཚེ་ན་འདུས་པ་ཆེར་གྱུར་པ་དེའི་ཚེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་འོད་ཟེར་བྱུང་ངོ་། །
en: At the time of this great gathering, light rays shone in the great Avīci hell.

source: བྱུང་ནས་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་སོང་བ་དང་། དེ་དག་གིས་གཙུག་ལག་ཁང་དེ་ཡོངས་སུ་མཛེས་པར་སྣང་སྟེ། །
en: Having shone there, they came to the Jetavana Monastery, where they became adornments for the monastery:

source: ཀ་བ་ནི་ལྷའི་ནོར་བུ་རིན་པོ་ཆེས་བརྒྱན་པར་སྣང་ངོ་།
en: pillars adorned with divine, precious jewels;

source: རྩིག་པ་བརྒྱ་དག་ཀྱང་གསེར་གྱིས་མཛེས་པར་བྱས་པར་སྣང་ངོ་། །
en: multistoried buildings that were covered with gold;

source: གནས་ཁང་སོ་སོ་དག་ན་ནི་གསེར་དང་དངུལ་ལས་བྱས་པའི་སྒོ་དག་སྣང་ངོ་། །
en: buildings with doors made of gold and silver;

source: གནས་ཁང་སོ་སོ་ན་སྐས་གསེར་དང་། དངུལ་ལས་བྱས་པ་དག་ཀྱང་སྣང་ངོ་། །
en: buildings with steps made of gold and silver;

source: དངུལ་གྱི་ཁང་པ་དག་ན་ནི་གསེར་གྱི་ཀ་བ་རིན་པོ་ཆེས་བརྒྱན། གསེར་གྱི་ཁང་པ་དག་ན་ནི་དངུལ་ཀྱི་ཀ་བ་རིན་པོ་ཆེས་བརྒྱན་པ་དང་།
en: and upper stories made of gold and silver, the silver upper stories having gold pillars adorned with divine jewels and the gold upper stories having silver pillars adorned with divine jewels.

source: ཛེ་ཏའི་ཚལ་གྱི་ཕྱི་རོལ་ན་ཤིང་དཔག་བསམ་རྣམ་པ་སྣ་ཚོགས་དག་སྣང་སྟེ།
en: In the gardens around Jetavana, there appeared various kinds of wish-fulfilling trees.

source: གསེར་གྱི་སྡོང་པོ་དང་། དངུལ་གྱི་ལོ་མ་དང་། རྒྱན་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་འཕྱང་བ་དག་དང་།
en: They had trunks of gold and leaves of silver and were bedecked with a variety of adornments,

source: ཡུལ་ཀ་ཤི་ཀ་ནས་བྱུང་བའི་གོས་རབ་ཏུ་འཕྱང་བ་དག་དང་།
en: with beautiful monastic robes, with Kaśika cloth,

source: རྒྱའི་གོས་བརྒྱ་སྟོང་རབ་ཏུ་འཕྱང་བ་དང་། མུ་ཏིག་གི་སེ་མོ་དོ་བརྒྱ་སྟོང་རབ་ཏུ་འཕྱང་བ་དང་། ཅོད་པན་དང་། རྣ་ཆ་དང་། ཕྲེང་བའི་ལྡ་ལྡི་དང་། དཔུང་རྒྱན་དང་། རྐང་པའི་གདུ་བུ་བརྒྱ་སྟོང་རབ་ཏུ་འཕྱང་བ་དང་།
en: with hundreds of thousands of pearl necklaces, and with hundreds of thousands of crowns, earrings, braided ribbons, armlets, and anklets.

source: ཕྱི་རོལ་ན་རིན་པོ་ཆེའི་གདུ་བུ་སྟེང་རིན་པོ་ཆེ་ལས་བྱས་པ། དེ་ལ་འཕྱང་བའི་ཤིང་དཔག་བསམ་གྱི་ཤིང་དེ་ལྟ་བུ་བརྒྱ་དག་ཀྱང་བྱུང་ངོ་། །
en: Outside the monastery there appeared hundreds of trees, which, like the wish-fulfilling trees, were made from precious metals and were bedecked with precious bracelets.

source: ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དེ་ཉིད་ན་སྐས་དག་ཀྱང་རྡོ་རྗེ་ལས་བྱས་པར་སྣང་ངོ་། །སྒོ་རྒྱབ་ན་མུ་ཏིག་དང་། དར་གྱི་ཚོགས་རབ་ཏུ་དཔྱངས་སོ། །
en: Within the Jetavana Monastery, there appeared stairs made from diamonds and entrance chambers hung with pearls and silks.

source: རྫིང་བུ་དུ་མ་དག་ཀྱང་བྱུང་སྟེ། །
en: Many bathing pools also appeared.

source: ལ་ལ་ནི་ཆུ་ཡན་ལག་བརྒྱད་དང་ལྡན་པས་ཡོངས་སུ་གང་།
en: Some were completely filled with water that had the eight qualities.

source: ལ་ལ་ནི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ་དག་འདི་ལྟ་སྟེ།
en: Some were completely filled with a variety of flowers:

source: མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པུན་ད་རཱི་ཀ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། ཨུ་དུམ་བཱ་ར་དག་གིས་ཡོངས་སུ་གང་ངོ་། །
en: they were completely filled with blue lotuses, red lotuses, night lotuses, white lotuses, tiger claw flowers and great tiger claw flowers, and udumbara flowers.

source: གཞན་ཡང་ཤིང་གི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་སྐྱེ་བ་འདི་ལྟ་སྟེ། །
en: Moreover, there were a variety of tree blossoms:

source: མེ་ཏོག་ཙམ་པ་ཀ་དང་། ཀ་ར་བཱི་ར་དང་། པ་ཊ་ལ་དང་། ཨ་ཏེ་མུག་ཏ་ཀ་དང་། དབྱར་གྱི་དྲི་དང་། གཞན་ཡང་ཤིང་གི་མེ་ཏོག་ཡིད་དགའ་བ་དག་བྱུང་སྟེ།
en: ashoka, oleander, trumpet flower, mountain ebony, jasmine, and other beautiful tree blossoms.

source: ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དེ་ཡོངས་སུ་མཛེས་པར་བྱས་པ་ཉིད་དུ་སྣང་ངོ་། །
en: The Jetavana Monastery appeared completely beautified.

source: དེ་ནས་འཁོར་དེ་ཉིད་ཀྱི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: From within that assembly Bodhisattva Sarva­nīvaraṇa­viṣkambhin arose from his seat, bared one shoulder, and kneeling on his right knee and
